arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_gpt.h
// Field:     [9] CBMDMAEN
//
// GPT Timer B Capture Match DMA Trigger Enable
#define GPT_DMAEV_CBMDMAEN                                          0x00000200
#define GPT_DMAEV_CBMDMAEN_BITN                                              9
#define GPT_DMAEV_CBMDMAEN_M                                        0x00000200
#define GPT_DMAEV_CBMDMAEN_S                                                 9

// Field:     [8] TBTODMAEN
//
// GPT Timer B Time-Out DMA Trigger Enable
#define GPT_DMAEV_TBTODMAEN                                         0x00000100
#define GPT_DMAEV_TBTODMAEN_BITN                                             8
#define GPT_DMAEV_TBTODMAEN_M                                       0x00000100
#define GPT_DMAEV_TBTODMAEN_S                                                8

// Field:     [4] TAMDMAEN
//
// GPT Timer A Match DMA Trigger Enable
#define GPT_DMAEV_TAMDMAEN                                          0x00000010
#define GPT_DMAEV_TAMDMAEN_BITN                                              4
#define GPT_DMAEV_TAMDMAEN_M                                        0x00000010
#define GPT_DMAEV_TAMDMAEN_S                                                 4

// Field:     [3] RTCDMAEN
//
// GPT RTC Match DMA Trigger Enable
#define GPT_DMAEV_RTCDMAEN                                          0x00000008
#define GPT_DMAEV_RTCDMAEN_BITN                                              3
#define GPT_DMAEV_RTCDMAEN_M                                        0x00000008
#define GPT_DMAEV_RTCDMAEN_S                                                 3

// Field:     [2] CAEDMAEN
//
// GPT Timer A Capture Event DMA Trigger Enable
#define GPT_DMAEV_CAEDMAEN                                          0x00000004
#define GPT_DMAEV_CAEDMAEN_BITN                                              2
#define GPT_DMAEV_CAEDMAEN_M                                        0x00000004
#define GPT_DMAEV_CAEDMAEN_S                                                 2

// Field:     [1] CAMDMAEN
//
// GPT Timer A Capture Match DMA Trigger Enable
#define GPT_DMAEV_CAMDMAEN                                          0x00000002
#define GPT_DMAEV_CAMDMAEN_BITN                                              1
#define GPT_DMAEV_CAMDMAEN_M                                        0x00000002
#define GPT_DMAEV_CAMDMAEN_S                                                 1

// Field:     [0] TATODMAEN
//
// GPT Timer A Time-Out DMA Trigger Enable
#define GPT_DMAEV_TATODMAEN                                         0x00000001
#define GPT_DMAEV_TATODMAEN_BITN                                             0
#define GPT_DMAEV_TATODMAEN_M                                       0x00000001
#define GPT_DMAEV_TATODMAEN_S                                                0

//*****************************************************************************
//
// Register: GPT_O_ADCEV
//
//*****************************************************************************
// Field:    [11] TBMADCEN
//
// GPT Timer B Match ADC Trigger Enable
#define GPT_ADCEV_TBMADCEN                                          0x00000800
#define GPT_ADCEV_TBMADCEN_BITN                                             11
#define GPT_ADCEV_TBMADCEN_M                                        0x00000800
#define GPT_ADCEV_TBMADCEN_S                                                11

// Field:    [10] CBEADCEN
//
// GPT Timer B Capture Event ADC Trigger Enable
#define GPT_ADCEV_CBEADCEN                                          0x00000400
#define GPT_ADCEV_CBEADCEN_BITN                                             10
#define GPT_ADCEV_CBEADCEN_M                                        0x00000400
#define GPT_ADCEV_CBEADCEN_S                                                10

// Field:     [9] CBMADCEN
//
// GPT Timer B Capture Match ADC Trigger Enable
#define GPT_ADCEV_CBMADCEN                                          0x00000200
#define GPT_ADCEV_CBMADCEN_BITN                                              9
#define GPT_ADCEV_CBMADCEN_M                                        0x00000200
#define GPT_ADCEV_CBMADCEN_S                                                 9

// Field:     [8] TBTOADCEN
//
// GPT Timer B Time-Out ADC Trigger Enable
#define GPT_ADCEV_TBTOADCEN                                         0x00000100
#define GPT_ADCEV_TBTOADCEN_BITN                                             8
#define GPT_ADCEV_TBTOADCEN_M                                       0x00000100
#define GPT_ADCEV_TBTOADCEN_S                                                8

// Field:     [4] TAMADCEN
//
// GPT Timer A Match ADC Trigger Enable
#define GPT_ADCEV_TAMADCEN                                          0x00000010
#define GPT_ADCEV_TAMADCEN_BITN                                              4
#define GPT_ADCEV_TAMADCEN_M                                        0x00000010
#define GPT_ADCEV_TAMADCEN_S                                                 4

// Field:     [3] RTCADCEN
//
// GPT RTC Match ADC Trigger Enable
#define GPT_ADCEV_RTCADCEN                                          0x00000008
#define GPT_ADCEV_RTCADCEN_BITN                                              3
#define GPT_ADCEV_RTCADCEN_M                                        0x00000008
#define GPT_ADCEV_RTCADCEN_S                                                 3

// Field:     [2] CAEADCEN
//
// GPT Timer A Capture Event ADC Trigger Enable
#define GPT_ADCEV_CAEADCEN                                          0x00000004
#define GPT_ADCEV_CAEADCEN_BITN                                              2
#define GPT_ADCEV_CAEADCEN_M                                        0x00000004
#define GPT_ADCEV_CAEADCEN_S                                                 2

// Field:     [1] CAMADCEN
//
// GPT Timer A Capture Match ADC Trigger Enable
#define GPT_ADCEV_CAMADCEN                                          0x00000002
#define GPT_ADCEV_CAMADCEN_BITN                                              1
#define GPT_ADCEV_CAMADCEN_M                                        0x00000002
#define GPT_ADCEV_CAMADCEN_S                                                 1

// Field:     [0] TATOADCEN
//
// GPT Timer A Time-Out ADC Trigger Enable
#define GPT_ADCEV_TATOADCEN                                         0x00000001
#define GPT_ADCEV_TATOADCEN_BITN                                             0
#define GPT_ADCEV_TATOADCEN_M                                       0x00000001
#define GPT_ADCEV_TATOADCEN_S                                                0

//*****************************************************************************
//
// Register: GPT_O_VERSION
//
//*****************************************************************************
// Field:  [31:0] VERSION
//
// Timer Revision.
#define GPT_VERSION_VERSION_M                                       0xFFFFFFFF
#define GPT_VERSION_VERSION_S                                                0

//*****************************************************************************
//
// Register: GPT_O_ANDCCP
//
//*****************************************************************************
// Field:     [0] CCP_AND_EN
//
// Enables anding of the CCP outputs for timers A and B
#define GPT_ANDCCP_CCP_AND_EN                                       0x00000001
#define GPT_ANDCCP_CCP_AND_EN_BITN                                           0
#define GPT_ANDCCP_CCP_AND_EN_M                                     0x00000001
#define GPT_ANDCCP_CCP_AND_EN_S                                              0


#endif // __GPT__
